# Data [Input/Output](https://pandas.pydata.org/docs/reference/io.html)
By far the most important thing to learn and the first thing you will need to do when working with data is reading in data for analysis and saving your outputs
- CSV
- Excel
- HTML

In [1]:
import numpy as np
import pandas as pd

To open a file you will need to make sure it's either in the same directory as the notebook you are working from or provide a filepath
In order to check the location of your jupyter notebook type 'pwd' into a code cell and hit Shit+Enter

In [ ]:
pwd # run this cell

## Open CSV files with [pd.read_csv()](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html)

In [2]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
df = pd.read_csv('example.csv')

## Save DataFrame to CSV file with [.to_csv()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html)

In [4]:
df.to_csv('My_output.csv', index=False) # Set index=False if you do not want the index saved as a column

## Open Excel files with [pd.read_excel()](https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html)
Can't import formulas, images and macros (may cause pandas to crash): Only data

You may need to install [openpyxl](https://openpyxl.readthedocs.io/en/stable/) as a dependency in your terminal or anaconda prompt:

    conda install openpyxl


Then restart you notebook.
(or use pip install if you aren't using the Anaconda Distribution)

In [5]:
pd.read_excel('Excel_Example.xlsx')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

## Save DataFrame to Excel file with [.to_excel()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_excel.html)

In [6]:
df.to_excel('Excel_Save.xlsx')

## Read HTML tables with [pd.read_html()](https://pandas.pydata.org/docs/reference/api/pandas.read_html.html)

You may need to install [htmllib5](https://pypi.org/project/html5lib/), [lxml](https://lxml.de/) and [BeautifulSoup4](https://pypi.org/project/beautifulsoup4/). In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

In [7]:
html_data = pd.read_html("https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list")

In [8]:
html_data[0] #stored as a list

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645